Управление_по_целям_и_KPI/src/DocumentJournals/KPI_КадровыеДокументы/KPI_КадровыеДокументы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DocumentJournal>
  <name>KPI_КадровыеДокументы</name>
  <registeredDocuments>Document.KPI_ПриказОНазначенииНаДолжность</registeredDocuments>
  <registeredDocuments>Document.KPI_ПриказОСнятииСДолжности</registeredDocuments>
  <registeredDocuments>Document.KPI_ПриказОПереводе</registeredDocuments>
  <registeredDocuments>Document.KPI_Табель</registeredDocuments>
  <registeredDocuments>Document.KPI_Невыходы</registeredDocuments>
  <registeredDocuments>Document.KPI_ВводПрекращениеНачислений</registeredDocuments>
</mdclass:DocumentJournal>

Управление_по_целям_и_KPI/src/InformationRegisters/KPI_СтруктураКомпании/KPI_СтруктураКомпании.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>KPI_СтруктураКомпании</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.KPI_Сотрудники</types>
    </type>
  </resources>
  <resources>
    <name>Уволен</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>СкрытьВСтруктуре</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>СтруктураУдалена</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>СтруктураКомпании</name>
    <type>
      <types>CatalogRef.KPI_СтруктураКомпании</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Управление_по_целям_и_KPI/src/Documents/KPI_ПриказОНазначенииНаДолжность/KPI_ПриказОНазначенииНаДолжность.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>KPI_ПриказОНазначенииНаДолжность</name>
  <registerRecords>InformationRegister.KPI_ГрафикиРаботыСотрудников</registerRecords>
  <registerRecords>InformationRegister.KPI_ПлановыеНачисления</registerRecords>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.KPI_СтруктураКомпании</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Сотрудники</name>
    <attributes>
      <name>СтруктураКомпании</name>
      <type>
        <types>CatalogRef.KPI_СтруктураКомпании</types>
      </type>
    </attributes>
    <attributes>
      <name>ФизЛицо</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>Квалификация</name>
      <type>
        <types>CatalogRef.KPI_Квалификации</types>
      </type>
    </attributes>
    <attributes>
      <name>ГрафикРаботы</name>
      <type>
        <types>CatalogRef.KPI_ГрафикиРабот</types>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторПользователяИБ</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>Пользователь</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПлановыеНачисления</name>
    <attributes>
      <name>СтруктураКомпании</name>
      <type>
        <types>CatalogRef.KPI_СтруктураКомпании</types>
      </type>
    </attributes>
    <attributes>
      <name>Начисление</name>
      <type>
        <types>ChartOfCalculationTypesRef.KPI_Начисления</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Управление_по_целям_и_KPI/src/Documents/KPI_ПриказОПереводе/KPI_ПриказОПереводе.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>KPI_ПриказОПереводе</name>
  <registerRecords>InformationRegister.KPI_ГрафикиРаботыСотрудников</registerRecords>
  <registerRecords>InformationRegister.KPI_ПлановыеНачисления</registerRecords>
  <attributes>
    <name>ИзменятьКвалификацию</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.KPI_СтруктураКомпании</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Сотрудники</name>
    <attributes>
      <name>СтараяДолжность</name>
      <type>
        <types>CatalogRef.KPI_СтруктураКомпании</types>
      </type>
    </attributes>
    <attributes>
      <name>СтруктураКомпании</name>
      <type>
        <types>CatalogRef.KPI_СтруктураКомпании</types>
      </type>
    </attributes>
    <attributes>
      <name>Квалификация</name>
      <type>
        <types>CatalogRef.KPI_Квалификации</types>
      </type>
    </attributes>
    <attributes>
      <name>ГрафикРаботы</name>
      <type>
        <types>CatalogRef.KPI_ГрафикиРабот</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПлановыеНачисления</name>
    <attributes>
      <name>СтруктураКомпании</name>
      <type>
        <types>CatalogRef.KPI_СтруктураКомпании</types>
      </type>
    </attributes>
    <attributes>
      <name>Начисление</name>
      <type>
        <types>ChartOfCalculationTypesRef.KPI_Начисления</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Управление_по_целям_и_KPI/src/Documents/KPI_ПриказОСнятииСДолжности/KPI_ПриказОСнятииСДолжности.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>KPI_ПриказОСнятииСДолжности</name>
  <registerRecords>InformationRegister.KPI_КадроваяИсторияСотрудников</registerRecords>
  <registerRecords>InformationRegister.KPI_ПлановыеНачисления</registerRecords>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.KPI_СтруктураКомпании</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Сотрудники</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.KPI_Сотрудники</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Управление_по_целям_и_KPI/src/Documents/KPI_Табель/KPI_Табель.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>KPI_Табель</name>
  <registerRecords>AccumulationRegister.KPI_РабочееВремяСотрудников</registerRecords>
  <attributes>
    <name>Филиал</name>
    <type>
      <types>CatalogRef.KPI_Филиалы</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.KPI_СтруктураКомпании</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ОтработанноеВремя</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.KPI_Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>Часов1</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Часов2</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Часов3</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Часов4</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Часов5</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Часов6</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Часов7</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Часов8</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Часов9</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Часов10</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Часов11</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Часов12</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Часов13</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Часов14</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Часов15</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Часов16</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Часов17</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Часов18</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Часов19</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Часов20</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Часов21</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Часов22</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Часов23</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Часов24</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Часов25</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Часов26</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Часов27</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Часов28</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Часов29</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Часов30</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Часов31</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Управление_по_целям_и_KPI/src/Catalogs/KPI_Сотрудники/KPI_Сотрудники.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>KPI_Сотрудники</name>
  <attributes>
    <name>СтруктураКомпании</name>
    <type>
      <types>CatalogRef.KPI_СтруктураКомпании</types>
    </type>
  </attributes>
  <attributes>
    <name>ФизическоеЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>Квалификация</name>
    <type>
      <types>CatalogRef.KPI_Квалификации</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторПользователяИБ</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
</mdclass:Catalog>

Управление_по_целям_и_KPI/src/DocumentJournals/KPI_КадровыеДокументы/Forms/ФормаСписка/Module.bsl
&НаКлиенте
Процедура ОтборФизЛицоПриИзменении(Элемент)
	
	ОтборыПриИзмененииСервер();
	
КонецПроцедуры

&НаСервере
Процедура ОтборыПриИзмененииСервер()
	
	ТекстУсловие = "";
	Если ЗначениеЗаполнено(ЭтаФорма.ОтборФизЛицо)
		И ЗначениеЗаполнено(ЭтаФорма.ОтборСтруктураКомпании) Тогда
		ТекстУсловие = " KPI_Сотрудники.ФизическоеЛицо = &ФизическоеЛицо
		| И KPI_Сотрудники.СтруктураКомпании = &СтруктураКомпании";
	ИначеЕсли ЗначениеЗаполнено(ЭтаФорма.ОтборФизЛицо) Тогда
		ТекстУсловие = " KPI_Сотрудники.ФизическоеЛицо = &ФизическоеЛицо";
	ИначеЕсли ЗначениеЗаполнено(ЭтаФорма.ОтборСтруктураКомпании) Тогда
		ТекстУсловие = " KPI_Сотрудники.СтруктураКомпании = &СтруктураКомпании";
	Иначе
		KPI_ИнтерфейсКлиентСервер.УдалитьЭлементОтбораСписка(ЭтаФорма.Список,
		"Ссылка");
		Возврат;
	КонецЕсли;
	
	ТекстЗапроса = "ВЫБРАТЬ
	|	KPI_СтруктураКомпании.СтруктураКомпании КАК СтруктураКомпании,
	|	KPI_СтруктураКомпании.Сотрудник КАК Сотрудник,
	|	KPI_СтруктураКомпании.Период
	|ПОМЕСТИТЬ СрезСтруктуры
	|ИЗ
	|	РегистрСведений.KPI_СтруктураКомпании КАК KPI_СтруктураКомпании
	|ГДЕ
	|	KPI_СтруктураКомпании.Сотрудник В(&Сотрудники)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	СтруктураКомпании,
	|	Сотрудник
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	KPI_ПриказОНазначенииНаДолжностьСотрудники.Ссылка
	|ИЗ
	|	РегистрСведений.KPI_СтруктураКомпании.СрезПервых(
	|			,
	|			(СтруктураКомпании, Сотрудник) В
	|				(ВЫБРАТЬ
	|					СрезСтруктуры.СтруктураКомпании,
	|					СрезСтруктуры.Сотрудник
	|				ИЗ
	|					СрезСтруктуры КАК СрезСтруктуры)) КАК KPI_СтруктураКомпанииСрезПервых
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.KPI_ПриказОНазначенииНаДолжность.Сотрудники КАК KPI_ПриказОНазначенииНаДолжностьСотрудники
	|		ПО KPI_СтруктураКомпанииСрезПервых.СтруктураКомпании = KPI_ПриказОНазначенииНаДолжностьСотрудники.СтруктураКомпании
	|			И KPI_СтруктураКомпанииСрезПервых.Период = KPI_ПриказОНазначенииНаДолжностьСотрудники.Ссылка.Дата
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	KPI_ПриказОПереводеСотрудники.Ссылка
	|ИЗ
	|	СрезСтруктуры КАК СрезСтруктуры
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.KPI_ПриказОПереводе.Сотрудники КАК KPI_ПриказОПереводеСотрудники
	|		ПО СрезСтруктуры.СтруктураКомпании = KPI_ПриказОПереводеСотрудники.СтруктураКомпании
	|			И СрезСтруктуры.Период = KPI_ПриказОПереводеСотрудники.Ссылка.Дата
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	KPI_ПриказОСнятииСДолжностиСотрудники.Ссылка
	|ИЗ
	|	Документ.KPI_ПриказОСнятииСДолжности.Сотрудники КАК KPI_ПриказОСнятииСДолжностиСотрудники
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ СрезСтруктуры КАК СрезСтруктуры
	|		ПО KPI_ПриказОСнятииСДолжностиСотрудники.Сотрудник = СрезСтруктуры.Сотрудник
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	KPI_ТабельОтработанноеВремя.Ссылка
	|ИЗ
	|	СрезСтруктуры КАК СрезСтруктуры
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.KPI_Табель.ОтработанноеВремя КАК KPI_ТабельОтработанноеВремя
	|		ПО СрезСтруктуры.Сотрудник = KPI_ТабельОтработанноеВремя.Сотрудник
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	KPI_Невыходы.Ссылка
	|ИЗ
	|	СрезСтруктуры КАК СрезСтруктуры
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.KPI_Невыходы КАК KPI_Невыходы
	|		ПО СрезСтруктуры.Сотрудник = KPI_Невыходы.Сотрудник
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	KPI_ВводПрекращениеНачислений.Ссылка
	|ИЗ
	|	СрезСтруктуры КАК СрезСтруктуры
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.KPI_ВводПрекращениеНачислений КАК KPI_ВводПрекращениеНачислений
	|		ПО СрезСтруктуры.Сотрудник = KPI_ВводПрекращениеНачислений.ОбъектУправления";
	
	Запрос = Новый Запрос(ТекстЗапроса);
	
	ТекстЗапросаСотрудники = "ВЫБРАТЬ
	|	KPI_Сотрудники.Ссылка
	|ИЗ
	|	Справочник.KPI_Сотрудники КАК KPI_Сотрудники
	|ГДЕ
	|	&Условие";


	ТекстЗапросаСотрудники = СтрЗаменить(ТекстЗапросаСотрудники,"&Условие",ТекстУсловие);	
	ЗапросСотрудники = Новый Запрос(ТекстЗапросаСотрудники);
	
	ЗапросСотрудники.УстановитьПараметр("ФизическоеЛицо"   ,ЭтаФорма.ОтборФизЛицо);
	ЗапросСотрудники.УстановитьПараметр("СтруктураКомпании",ЭтаФорма.ОтборСтруктураКомпании);

	Сотрудники = ЗапросСотрудники.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
	Запрос.УстановитьПараметр("Сотрудники",Сотрудники);
	
	ДокументыСотрудника = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
	KPI_ИнтерфейсКлиентСервер.ИзменитьЭлементОтбораСписка(ЭтаФорма.Список,
	"Ссылка",ДокументыСотрудника,
	Истина,ВидСравненияКомпоновкиДанных.ВСписке);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборСтруктураКомпанииПриИзменении(Элемент)
	
	ОтборыПриИзмененииСервер();
	
КонецПроцедуры
